Repository: 6639835/IpaDownloadTool
Catalog: IpaDownloadTool/IpaDownloadTool/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# agreement.accept
source: Agree and Continue
zh_hans: 同意并继续

# agreement.body
source: 1. IPA Download Tool is designed to extract ipa information from third-party web pages for learning and testing only. Do not use it for any illegal or abusive purpose. 2. The app doesn't support extracting ipa files from the App Store or from apps already installed on this device. 3. Link history, extraction history, and downloaded files are stored locally on device and aren't uploaded to the cloud. 4. You can launch the app directly from Safari with ipadownloadtool://hander?url=.
zh_hans: 1. “IPA提取器”用于提取第三方网页中的 ipa 信息，仅限学习交流，不得用于违法违规用途。 2. 本应用不支持提取 App Store 的 ipa，也不支持导出本机已安装 App 的 ipa。 3. 链接历史、提取历史、下载文件均默认保存在本机，不上传云端。 4. 通过 ipadownloadtool://hander?url= 可直接从 Safari 唤起本应用并加载链接。

# agreement.heading.detail
source: iOS 26 enables Liquid Glass automatically. Review the usage boundaries before continuing.
zh_hans: iOS 26 会自动启用 Liquid Glass。继续前请先确认应用使用边界。

# agreement.heading.title
source: Review the usage notice first
zh_hans: 先确认使用说明

# browser.address.idleTitle
source: Waiting for a link
zh_hans: 等待输入链接

# browser.address.placeholder
source: Enter a download page URL or an itms-services link
zh_hans: 输入下载页 URL 或 itms-services 链接

# browser.directIPA.download
source: Treat as IPA download
zh_hans: 当作 IPA 下载

# browser.directIPA.message
source: This link may point directly to an ipa file.
zh_hans: 当前链接可能是一个直接的 ipa 文件地址。

# browser.directIPA.title
source: IPA download link detected
zh_hans: 检测到 IPA 下载地址

# browser.directIPA.visit
source: Treat as webpage
zh_hans: 当作网页访问

# browser.heading.detail
source: Liquid Glass handles the chrome on iOS 26 while Swift, WKWebView, and URLSession power the extraction flow.
zh_hans: iOS 26 的 Liquid Glass 负责界面层次，核心提取流程由 Swift、WKWebView 和 URLSession 实现。

# browser.heading.eyebrow
source: Browser
zh_hans: 浏览

# browser.heading.title
source: Native extraction workspace
zh_hans: 全原生提取工作台

# browser.navigation.title
source: Browse
zh_hans: 浏览

# browser.provision.message
source: The legacy app tried to interpret some UDID profile flows. The Swift-native version opens these links in Safari instead.
zh_hans: 原项目曾尝试解析部分 UDID 描述文件。全 Swift 原生重构版会先将这类链接交给 Safari 处理。

# browser.provision.openSafari
source: Open in Safari
zh_hans: 在 Safari 中打开

# browser.provision.title
source: Provisioning profile link detected
zh_hans: 检测到描述文件地址

# browser.scanner.instruction
source: Place the QR code inside the frame
zh_hans: 将二维码放入取景框内

# common.cancel
source: Cancel
zh_hans: 取消

# common.close
source: Close
zh_hans: 关闭

# common.done
source: Done
zh_hans: 完成

# common.notDownloaded
source: Not downloaded
zh_hans: 未下载

# common.ok
source: OK
zh_hans: 知道了

# common.unknown
source: Unknown
zh_hans: 未知

# common.untitledApp
source: Untitled App
zh_hans: 未命名应用

# downloads.action.cancel
source: Cancel Download
zh_hans: 取消下载

# downloads.empty.completed.detail
source: Downloaded IPA files will appear here and can be shared directly.
zh_hans: 已下载的文件会在这里显示，可直接分享。

# downloads.empty.completed.title
source: No local IPA files yet
zh_hans: 还没有本地 IPA

# downloads.empty.inProgress.detail
source: Downloads started from history or detail screens will appear here with live progress.
zh_hans: 从历史或详情页发起下载后，这里会显示实时状态。

# downloads.empty.inProgress.title
source: No active downloads
zh_hans: 没有进行中的下载

# downloads.heading.detail
source: Foreground downloads use native URLSession and completed files are stored in Application Support.
zh_hans: 前台下载使用原生 URLSession。已完成文件会直接落到本地 Application Support。

# downloads.heading.eyebrow
source: Files
zh_hans: 文件

# downloads.heading.title
source: Download center
zh_hans: 下载中心

# downloads.mode.completed
source: Downloaded
zh_hans: 已下载

# downloads.mode.inProgress
source: In Progress
zh_hans: 下载中

# downloads.mode.label
source: Mode
zh_hans: 模式

# downloads.navigation.title
source: Downloads
zh_hans: 下载

# downloads.size.calculating
source: Calculating…
zh_hans: 计算中

# downloads.state.cancelled
source: Cancelled
zh_hans: 已取消

# downloads.state.downloading
source: Downloading
zh_hans: 下载中

# downloads.state.failed
source: Failed
zh_hans: 失败

# downloads.state.finished
source: Finished
zh_hans: 已完成

# downloads.state.queued
source: Queued
zh_hans: 等待中

# extraction.error.invalidManifest
source: Unable to parse the manifest plist.
zh_hans: 无法解析 manifest plist。

# extraction.error.invalidResponse
source: The server returned an invalid response.
zh_hans: 服务器返回了无效响应。

# history.action.clear
source: Clear
zh_hans: 清空

# history.action.delete
source: Delete Record
zh_hans: 删除记录

# history.action.startDownload
source: Start Download
zh_hans: 开始下载

# history.action.viewDetails
source: View Details
zh_hans: 查看详情

# history.badge.downloaded
source: Downloaded
zh_hans: 已下载

# history.clear.confirm.message
source: All extracted records and downloaded files will be permanently deleted. This cannot be undone.
zh_hans: 所有提取记录和已下载的文件将被永久删除，此操作无法撤销。

# history.clear.confirm.title
source: Clear History
zh_hans: 清除历史记录

# history.detail.appName
source: App Name
zh_hans: 应用名称

# history.detail.appNamePlaceholder
source: Enter an app name
zh_hans: 输入应用名称

# history.detail.createdAt
source: Created At
zh_hans: 创建时间

# history.detail.downloadAgain
source: Download or Redownload
zh_hans: 下载或重新下载

# history.detail.downloadURL
source: Download URL
zh_hans: 下载地址

# history.detail.missing.detail
source: This record may already have been deleted.
zh_hans: 这条历史记录可能已经被删除。

# history.detail.missing.title
source: Record not found
zh_hans: 记录不存在

# history.detail.navigation.title
source: App Details
zh_hans: 应用详情

# history.detail.shareLocalIPA
source: Share Local IPA
zh_hans: 分享本地 IPA

# history.detail.sourceURL
source: Source URL
zh_hans: 来源地址

# history.detail.versionMissing
source: No version number
zh_hans: 无版本号

# history.empty.detail
source: Open a page in the browser, intercept a manifest, or detect a direct ipa link to create a record here.
zh_hans: 从浏览页打开下载页、拦截 manifest 或直接识别 ipa 链接后，记录会出现在这里。

# history.empty.title
source: No extraction history yet
zh_hans: 还没有提取记录

# history.heading.detail
source: All records stay on device. Sort, delete, and redownload from here.
zh_hans: 所有记录都保存在本地。排序、删除、再次下载都在这里完成。

# history.heading.eyebrow
source: Archive
zh_hans: 归档

# history.heading.title
source: Extraction history
zh_hans: 提取历史

# history.navigation.title
source: IPA Download Tool
zh_hans: IPA 提取器

# history.sort.createdAt
source: By Date
zh_hans: 按时间排序

# history.sort.fileName
source: By File Name
zh_hans: 按文件名排序

# history.sort.label
source: Sort
zh_hans: 排序

# import.error.invalidEncoding
source: The clipboard content isn't valid UTF-8 text.
zh_hans: 剪贴板中的内容不是 UTF-8 文本。

# import.error.invalidPayload
source: The clipboard content doesn't match a supported import format.
zh_hans: 剪贴板中的数据无法识别为可导入格式。

# notice.blockedAccess.message
source: Access to %@ is blocked by the current rules.
zh_hans: 根据当前规则，%@ 已被禁止访问。

# notice.blockedAccess.title
source: Access Blocked
zh_hans: 访问禁止

# notice.downloadFailed.invalidURL
source: The download URL is invalid.
zh_hans: 下载地址无效。

# notice.downloadFailed.title
source: Download Failed
zh_hans: 下载失败

# notice.exportFailed.message
source: The app couldn't generate export content.
zh_hans: 无法生成导出内容。

# notice.exportFailed.title
source: Export Failed
zh_hans: 导出失败

# notice.extractionFailed.title
source: Extraction Failed
zh_hans: 提取失败

# notice.importComplete.message
source: Imported %lld IPA records and %lld web history items.
zh_hans: 已导入 %lld 条 IPA 记录和 %lld 条网页历史。

# notice.importComplete.title
source: Import Complete
zh_hans: 导入完成

# notice.importFailed.emptyPasteboard
source: There isn't any importable data on the clipboard.
zh_hans: 剪贴板没有可导入的数据。

# notice.importFailed.title
source: Import Failed
zh_hans: 导入失败

# notice.invalidLink.message
source: Enter a valid http, https, or itms-services link.
zh_hans: 请输入有效的 http、https 或 itms-services 链接。

# notice.invalidLink.title
source: Invalid Link
zh_hans: 链接无效

# notice.loadFailed.title
source: Load Failed
zh_hans: 加载失败

# root.pasteboard.ignore
source: Ignore
zh_hans: 忽略

# root.pasteboard.open
source: Paste and Open
zh_hans: 粘贴并前往

# root.pasteboard.title
source: Detected a link on the clipboard
zh_hans: 检测到剪贴板中的链接

# settings.action.export
source: Export Local Data
zh_hans: 导出本地数据

# settings.action.import
source: Import from Clipboard
zh_hans: 从剪贴板导入数据

# settings.blockedHosts
source: Blocked Hosts
zh_hans: 禁止访问 Host

# settings.developerMode
source: Developer Mode
zh_hans: 开发者模式

# settings.heading.detail
source: Liquid Glass gives the interface depth while settings stay explicit, editable, and import/export friendly.
zh_hans: Liquid Glass 负责层次与交互质感，功能设置仍保持明确、可编辑、可导入导出。

# settings.heading.eyebrow
source: System
zh_hans: 系统

# settings.heading.title
source: Settings and About
zh_hans: 设置与关于

# settings.mobileProvisionRules
source: Provisioning Profile Match Rules
zh_hans: 描述文件匹配规则

# settings.navigation.title
source: Settings
zh_hans: 设置

# settings.opensource
source: Open Source Repository and Releases
zh_hans: 开源仓库与版本更新

# settings.summary
source: Saved %lld IPA records and %lld web history items.
zh_hans: 已保存 %lld 条 IPA 记录，%lld 条网页记录。

# settings.virtualUDID
source: Virtual UDID
zh_hans: 虚拟 UDID

# settings.virtualUDID.placeholder
source: Enter a virtual UDID
zh_hans: 输入虚拟 UDID

# tab.browser
source: Browse
zh_hans: 浏览

# tab.downloads
source: Downloads
zh_hans: 下载

# tab.history
source: History
zh_hans: 历史

# tab.settings
source: Settings
zh_hans: 设置
